//- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function square(a,b) {
// let result1 = a * b;
// return result1;
// }
// let answer = square(10,20);
// console.log(answer);

//- створити функцію яка обчислює та повертає площу кола з радіусом r
// function square(r) {
//     const PI = 3.14;
//     let s= PI*r*r;
//     return s;
// }
// let answer = square(12);
// console.log(answer);

//- створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// function square(r,h) {
//     const PI = 3.14;
//     let s=2*PI*r*h;
//     return s;
// }
// let answer = square(11,22);
// console.log(answer);

// - створити функцію яка приймає масив та виводить кожен його елемент
// function iterator(array) {
//     for (const item of array) {
//         console.log(item);
//     }
// }
// let users = [
//     {id: 'vasya', name: 31, age: false},
//     {id: 'petya', name: 30, age: true},
//     {id: 'kolya', name: 29, age: true},
//     {id: 'olya', name: 28, age: false},
// ];
// iterator(users);

//- створити функцію яка створює параграф з текстом. Текст задати через аргумент

//- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function textul(text){
//
//     document.write('<ul>');
//
//         for (let i = 0; i < 3; i++) {
//             document.write(`<li>${text}</li>`)}
//
//             document.write('</ul>');
//
//         }
//
//         textul('Hello okten');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
//- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
//- створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13